[
    {
        "project": "Fribago.com",
        "img": "fribago.png",
        "methods": ["Figma", "HTML", "PHP", "CSS", "JavaScript", "PHPMyAdmin", "Jira"],
        "shortDescription": "Ongoing project for Disc Golf Players. There is a group of four students working with this. Now the site is in test phase. We are doing constant development on this site, as well as creating new features on the background.",
        "description": "FribaGo.com on sivusto frisbeegolfin pelaajille. Ajatus tuli lajia harrastavalta luokkakaverilta, jolla oli mututuntumaa siitä, että nykyisten frisbeegolf-sovellusten rinnalla olisi kysyntää jollekin uudelle ja hieman erilaiselle toteutukselle. Ja siitä se sitten lähti. Kehitys aloitettiin loppukeväästä 2023 ja loppukesästä päästiin ottamaan sisään testikäyttäjiä. Heidän palautteensa avulla kehitystyö jatkuu. FribaGo on selainpohjainen sivusto, joka on tehty skaalautumaan myös tableteille ja matkapuhelimille. Ohjelmaa kehitetään jatkuvasti opintojen ja töiden ohessa. Tämä on ollut meille tekijöille todellinen oppimatka. Meille on kullekin muodostunut jonkinlaiset pääroolit kehityksessä, mutta kaikki auttavat toisiaan siellä missä tarvitaan. Näin jokainen on päässyt kehittämään taitojaan monenlaisissa kehityksen tehtävissä. FribaGossa käyttäjät voivat lisätä ohjelmaan ratoja ja layouteja, joita kuka tahansa käyttäjä voi pelatessaan käyttää. Väyläkuvan voi lisätä peliradalta, mutta jos sitä ei ole saatavilla, on ohjelmaan tehty piirto-ohjelma, jolla väyläkuvan voi piirtää. Omat tulokset pelikierroksilta voi tallentaa, ja niistä näytetään myös tilastoja. Juuri julkaistu pari- ja joukkuepelimahdollisuus erilaisten sääntöjen kanssa on toivottu ominaisuus. Toivomusta tuli myös vaaleasta teemasta oletuksena olevan tumman teeman sijaan, ja sekin saatiin tuotua tarjolle viime päivityksessä. Tulevaisuudessa suunnitelmalistalle on kirjattu tilastointia, kommentointia, rekisteröitymättömän käyttäjän ottaminen mukaan joukkue-/paripeliin, mobiiliversio ja monta muuta sovellusta kehittävää tehtävää. Nämä kaikki ovat Jirassa, josta sitten yhdessä valikoidaan mitä seuraavaan päivitykseen tehdään. Kiitos ja kumarrus hyvästä yhteistyöstä kanssa-ahertajille: Anne Arhipoff, Antti Mutanen (idean isä) ja Mari Nieminen. Tätä on ollut ilo työstää kanssanne ja tästä on hyvä jatkaa!"
    },
    {
        "project": "Kirjanpitäjä",
        "img": "kirjanpitaja.png",
        "methods": ["Figma", "HTML", "PHP", "CSS", "JavaScript", "PHPMyAdmin", "Jira", "Confluence","Scrum"],
        "shortDescription": "Kirjanpitäjä was born during schools 'Design Factory Project'. The  project was done to meet customers expectations and the outcome was a functional bookkeeping-program. The review with customer was very positive.",
        "description": "Toisen vuoden opiskeluissa moduulissa 'Asiakasprojektien toteuttaminen' tehtiin nimensä mukaisesti projekti, joka toteuttiin asiakkaan tarpeen pohjalta. Ryhmämme valitsi annetuista vaihtoehdoista tositteiden tallentamisen kirjanpitoyritykselle. Tämä olisi voitu toteuttaa pelkästään mallina, jolla ei ole toiminnallisuuksia. Onneksi ryhmämme koostui ahkerasta porukasta joka halusi ehdottomasti toteuttaa täysin toimivan sivuston. Hyvällä yhteistyöllä saimmekin tämän toteutettua lyhyessä määräajassa. Asiakkaalta saatu palaute projektin lopussa oli todella positiivista.Tämän projektin aikana tutustuttiin syvällisemmin Scrum-menetelmään. Tiimi harjoittelikin kaikkea Scrumiin liittyvää: päivittäinen Daily, Backlog, Review ja Retrospektiivi tulivat varmasti tutummaksi projektin aikana. Myös asiakas oli mukana Teams-palavereissa Scrumin mukaisesti."
    },
    {
        "project": "Pöllötuvat",
        "img": "pollotuvat.png",
        "methods": ["Figma", "HTML", "PHP", "CSS", "JavaScript", "PHPMyAdmin", "Jira"],
        "shortDescription": "Web-development module at school had an assignment to make websites to a imaginary business. Our group made 'Pöllötuvat', a cabin renting site. First the site was implemented using WordPress, and after that the same result was made with PHP, HTML and Css(Bootstrap).",
        "description": "Opiskelujen aikana on päässyt kokeilemaan monenlaista. Tämä Pöllötuvat projekti syntyi ensimmäisenä opiskeluvuotena Web-kehitys moduulin aikana ryhmätyönä. Ryhmässä oli lisäkseni kaksi opiskelijaa toteuttamassa tätä kuvitteellista mökkien vuokraussivustoa. Projekti alkoi ulkonäön suunnittelemisella Figmassa. Jokainen tiiminjäsen teki oman ehdotuksensa ulkonäöstä, ja käyttöön valikoitui yhteisellä päätöksellä tekemäni malli. Suunnitelman pohjalta tehtiin kaksi erilaista toteutusta. Molempien toteutusten tuli olla ulkonäöltään Figmalla tehdyn suunnitelman mukaisia. Ensimmäinen toteutus tehtiin hyödyntämällä WordPressiä. Toteutuksen aikana opeteltiin hyödyntämään erilaisia Plugineja, sekä muokkamaan valmiita teemoja. Toisena toteutustyylinä syntyi sivusto HTML-koodia ja CSS:ää käyttäen. Muotoilupuolella kokeilimme BootStrappia, joka paljastui näppäräksi hyvän skaalautuvuutensa ansiosta."
    }

]